---
kind: other
id: Methods.T:Autodesk.Revit.DB.Leader
source: html/3f535c8b-3d0d-c0d4-7a0d-7f30972169e0.htm
---
# Leader Methods

Causes the object to release immediately any resources it may be utilizing.